# #Шаблон для контеста
# N_max = 0
# A = [0] * N_max # заполнение массива пустыми ячейками 0
# n = 0 # одновременно кол-во элементов и индекс в массиве A
# x = int(input())
#убрать элемент
# n-=1
# x = A[n]
# Самое главное тип данных list это не массив! Можно сказать что это модифицированный массив

# A = []
# x = int(input())
# A.append(x) # добавить элемент
# n = len(A) #узнать кол-во элементов
# x = A.pop() #убрать элемент списка


#List comprehensions
# A = [x**2 for x in range(10)]
# print(A)
# A = [1,2,3,4,5]
# B = [x**2 for x in A if x%2==0]


#Квадратичные сортировки
 